In [1]:
import pandas as pd
import numpy as np
import requests

In [2]:
sales = pd.read_csv("sales.txt")

In [3]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0

In [5]:
city_sales = sales.groupby(['City'])

In [6]:
city_sales

In [7]:
city_sales.sum()

      Units
City
HYD    80.0
VZG    41.0

In [8]:
city_sales.count()

      Month  Book  Units
City
HYD       4     4      3
VZG       4     4      4

In [10]:
city_sales['Month','Book'].count()

      Month  Book
City
HYD       4     4
VZG       4     4

In [14]:
for (c,rows) in city_sales:
     print(type(c))
     print(type(rows))

<class 'str'>
<class 'pandas.core.frame.DataFrame'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>

In [17]:
 city_sales['Units'].aggregate(['mean','sum','max'])

           mean   sum   max
City
HYD   26.666667  80.0  40.0
VZG   10.250000  41.0  14.0

In [18]:
city_sales.get_group('VZG')

   Book Month  Units
0  B100   JAN   10.0
1  B100   FEB    4.0
2  B100   MAR   13.0
6  B200   JAN   14.0

In [19]:
totals = city_sales.count()

In [21]:
totals
type(totals)

pandas.core.frame.DataFrame

In [22]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0

In [23]:
month_sales = sales.groupby(['Month','Book'])

In [24]:
month_sales.count()

            City  Units
Month Book
FEB   B100     2      2
      B200     1      0
JAN   B100     2      2
      B200     1      1
MAR   B100     2      2
      B200     0      1

In [26]:
month_sales.mean()

            Units
Month Book
FEB   B100   22.0
      B200    NaN
JAN   B100   20.0
      B200   14.0
MAR   B100   11.5
      B200    4.0

In [28]:
city_sales.apply(lambda d : d['Units'].max() - d['Units'].min())

City
HYD    30.0
VZG    10.0
dtype: float64

In [30]:
ss = city_sales.count()

In [31]:
ss.to_json("summary.txt")

In [32]:
ss

      Month  Book  Units
City
HYD       4     4      3
VZG       4     4      4

In [40]:
sales.pivot_table(index="Month", values='Units', columns='Book', aggfunc=[max,min])

        max         min
Book   B100  B200  B100  B200
Month
FEB    40.0   NaN   4.0   NaN
JAN    30.0  14.0  10.0  14.0
MAR    13.0   4.0  10.0   4.0

In [39]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0